{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\lhaase\Documents\hw1_log.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}27 Mar 2020, 23:11:59
{txt}
{com}. 
. use "strike_data.dta", clear
{txt}
{com}. 
. gen cntrdate = date - 15992
{txt}
{com}. gen interstkdt = cntrdate*strike
{txt}
{com}. 
. areg deficit_60 strike cntrdate interstkdt i.dayofwk [aw=weight], absorb(vds) cluster(vds)
{txt}(sum of wgt is 493,344,753.30157)
{res}
{txt}Linear regression, absorbing indicators{col 49}Number of obs{col 67}= {res}   178,549
{txt}Absorbed variable: {bf:vds}{col 49}No. of categories{col 67}= {res}       644
{txt}{col 49}F({res}   7{txt},{res}    643{txt}){col 67}= {res}     60.86
{txt}{col 49}Prob > F{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.2198
{txt}{col 49}Adj R-squared{col 67}= {res}    0.2170
{txt}{col 49}Root MSE{col 67}= {res}    0.8144

{txt}{ralign 78:(Std. Err. adjusted for {res:644} clusters in vds)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}  deficit_60{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}strike {c |}{col 14}{res}{space 2} .1942413{col 26}{space 2} .0177346{col 37}{space 1}   10.95{col 46}{space 3}0.000{col 54}{space 4} .1594166{col 67}{space 3}  .229066
{txt}{space 4}cntrdate {c |}{col 14}{res}{space 2}-.0038735{col 26}{space 2}  .000665{col 37}{space 1}   -5.82{col 46}{space 3}0.000{col 54}{space 4}-.0051794{col 67}{space 3}-.0025676
{txt}{space 2}interstkdt {c |}{col 14}{res}{space 2} .0065977{col 26}{space 2} .0007967{col 37}{space 1}    8.28{col 46}{space 3}0.000{col 54}{space 4} .0050333{col 67}{space 3} .0081621
{txt}{space 12} {c |}
{space 5}dayofwk {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .1646183{col 26}{space 2}  .013882{col 37}{space 1}   11.86{col 46}{space 3}0.000{col 54}{space 4} .1373587{col 67}{space 3} .1918779
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .0894744{col 26}{space 2} .0114578{col 37}{space 1}    7.81{col 46}{space 3}0.000{col 54}{space 4} .0669753{col 67}{space 3} .1119736
{txt}{space 10}4  {c |}{col 14}{res}{space 2} .1371054{col 26}{space 2} .0144675{col 37}{space 1}    9.48{col 46}{space 3}0.000{col 54}{space 4} .1086961{col 67}{space 3} .1655146
{txt}{space 10}5  {c |}{col 14}{res}{space 2} .2207996{col 26}{space 2} .0209262{col 37}{space 1}   10.55{col 46}{space 3}0.000{col 54}{space 4} .1797076{col 67}{space 3} .2618915
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .2210104{col 26}{space 2} .0188926{col 37}{space 1}   11.70{col 46}{space 3}0.000{col 54}{space 4} .1839117{col 67}{space 3} .2581091
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. ****restrict data to 10 day bandwidth
. drop if cntrdate>10 | cntrdate <-10
{txt}(117,270 observations deleted)

{com}. areg deficit_60 strike cntrdate interstkdt i.dayofwk [aw=weight], absorb(vds) cluster(vds)
{txt}(sum of wgt is 174,660,205.43085)
{res}
{txt}Linear regression, absorbing indicators{col 49}Number of obs{col 67}= {res}    62,142
{txt}Absorbed variable: {bf:vds}{col 49}No. of categories{col 67}= {res}       619
{txt}{col 49}F({res}   7{txt},{res}    618{txt}){col 67}= {res}     40.98
{txt}{col 49}Prob > F{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.2685
{txt}{col 49}Adj R-squared{col 67}= {res}    0.2610
{txt}{col 49}Root MSE{col 67}= {res}    0.7654

{txt}{ralign 78:(Std. Err. adjusted for {res:619} clusters in vds)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}  deficit_60{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}strike {c |}{col 14}{res}{space 2}-.1929487{col 26}{space 2} .0380353{col 37}{space 1}   -5.07{col 46}{space 3}0.000{col 54}{space 4}-.2676428{col 67}{space 3}-.1182547
{txt}{space 4}cntrdate {c |}{col 14}{res}{space 2} .0539481{col 26}{space 2} .0059289{col 37}{space 1}    9.10{col 46}{space 3}0.000{col 54}{space 4}  .042305{col 67}{space 3} .0655913
{txt}{space 2}interstkdt {c |}{col 14}{res}{space 2}-.0455619{col 26}{space 2} .0056025{col 37}{space 1}   -8.13{col 46}{space 3}0.000{col 54}{space 4}-.0565641{col 67}{space 3}-.0345598
{txt}{space 12} {c |}
{space 5}dayofwk {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .1854808{col 26}{space 2} .0164618{col 37}{space 1}   11.27{col 46}{space 3}0.000{col 54}{space 4} .1531529{col 67}{space 3} .2178088
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .0932907{col 26}{space 2}  .013455{col 37}{space 1}    6.93{col 46}{space 3}0.000{col 54}{space 4} .0668676{col 67}{space 3} .1197137
{txt}{space 10}4  {c |}{col 14}{res}{space 2}  .084051{col 26}{space 2} .0180533{col 37}{space 1}    4.66{col 46}{space 3}0.000{col 54}{space 4} .0485977{col 67}{space 3} .1195044
{txt}{space 10}5  {c |}{col 14}{res}{space 2} .1250566{col 26}{space 2} .0252181{col 37}{space 1}    4.96{col 46}{space 3}0.000{col 54}{space 4}  .075533{col 67}{space 3} .1745801
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .6156603{col 26}{space 2}  .040621{col 37}{space 1}   15.16{col 46}{space 3}0.000{col 54}{space 4} .5358883{col 67}{space 3} .6954323
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. ****restrict data to 5 day bandwidth
. drop if cntrdate>5 | cntrdate <-5
{txt}(34,491 observations deleted)

{com}. areg deficit_60 strike cntrdate interstkdt i.dayofwk [aw=weight], absorb(vds) cluster(vds)
{txt}(sum of wgt is 78,339,898.336348)
{p 0 6 2}note: 5.dayofwk omitted because of collinearity{p_end}
{res}
{txt}Linear regression, absorbing indicators{col 49}Number of obs{col 67}= {res}    27,835
{txt}Absorbed variable: {bf:vds}{col 49}No. of categories{col 67}= {res}       606
{txt}{col 49}F({res}   5{txt},{res}    605{txt}){col 67}= {res}     27.60
{txt}{col 49}Prob > F{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.3083
{txt}{col 49}Adj R-squared{col 67}= {res}    0.2928
{txt}{col 49}Root MSE{col 67}= {res}    0.7642

{txt}{ralign 78:(Std. Err. adjusted for {res:606} clusters in vds)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}  deficit_60{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}strike {c |}{col 14}{res}{space 2} .6731623{col 26}{space 2} .1481399{col 37}{space 1}    4.54{col 46}{space 3}0.000{col 54}{space 4} .3822314{col 67}{space 3} .9640932
{txt}{space 4}cntrdate {c |}{col 14}{res}{space 2}-.1396491{col 26}{space 2} .0324749{col 37}{space 1}   -4.30{col 46}{space 3}0.000{col 54}{space 4}-.2034263{col 67}{space 3} -.075872
{txt}{space 2}interstkdt {c |}{col 14}{res}{space 2} .1533933{col 26}{space 2} .0327942{col 37}{space 1}    4.68{col 46}{space 3}0.000{col 54}{space 4} .0889891{col 67}{space 3} .2177976
{txt}{space 12} {c |}
{space 5}dayofwk {c |}
{space 10}3  {c |}{col 14}{res}{space 2}-.1185937{col 26}{space 2} .0161618{col 37}{space 1}   -7.34{col 46}{space 3}0.000{col 54}{space 4}-.1503336{col 67}{space 3}-.0868537
{txt}{space 10}4  {c |}{col 14}{res}{space 2}-.1747824{col 26}{space 2}  .018598{col 37}{space 1}   -9.40{col 46}{space 3}0.000{col 54}{space 4}-.2113069{col 67}{space 3}-.1382579
{txt}{space 10}5  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0673215{col 26}{space 2} .1436275{col 37}{space 1}   -0.47{col 46}{space 3}0.639{col 54}{space 4}-.3493906{col 67}{space 3} .2147476
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
{txt}end of do-file

{com}. do "C:\Users\lhaase\AppData\Local\Temp\STD6e4_000000.tmp"
{txt}
{com}. *** Metrics
. *** Figures 4.2 4.4 4.5
. *** Tables 4.1
. *** MLDA Regression Discontinuity (based on data from Carpenter and Dobkin 2009)
. 
. clear
{txt}
{com}. 
. // set to directory where data is located
. cd "/Users/lhaase/Documents"
{res}C:\Users\lhaase\Documents
{txt}
{com}. 
. // create a folder called "Output" in that directory
. 
. use AEJfigs.dta
{txt}
{com}. 
. * All = all deaths
. gen age = agecell - 21
{txt}
{com}. gen over21 = agecell >= 21
{txt}
{com}. 
. gen age2 = age^2
{txt}
{com}. gen over_age = over21*age
{txt}
{com}. gen over_age2 = over21*age2
{txt}
{com}. 
. * Regressions for Figure 4.2.
. * linear trend, and linear on each side
. reg all age over21

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        48
{txt}{hline 13}{c +}{hline 34}   F(2, 45)        = {res}    32.99
{txt}       Model {c |} {res} 410.138151         2  205.069075   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 279.682408        45  6.21516463   {txt}R-squared       ={res}    0.5946
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.5765
{txt}       Total {c |} {res} 689.820559        47  14.6770332   {txt}Root MSE        =   {res}  2.493

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         all{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age {c |}{col 14}{res}{space 2}-.9746843{col 26}{space 2} .6324613{col 37}{space 1}   -1.54{col 46}{space 3}0.130{col 54}{space 4}-2.248527{col 67}{space 3} .2991581
{txt}{space 6}over21 {c |}{col 14}{res}{space 2} 7.662709{col 26}{space 2} 1.440286{col 37}{space 1}    5.32{col 46}{space 3}0.000{col 54}{space 4} 4.761824{col 67}{space 3} 10.56359
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 91.84137{col 26}{space 2} .8050394{col 37}{space 1}  114.08{col 46}{space 3}0.000{col 54}{space 4} 90.21994{col 67}{space 3}  93.4628
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. predict allfitlin
{txt}(option {bf:xb} assumed; fitted values)

{com}. reg all age over21 over_age

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        48
{txt}{hline 13}{c +}{hline 34}   F(3, 44)        = {res}    29.47
{txt}       Model {c |} {res} 460.574058         3  153.524686   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 229.246501        44  5.21014775   {txt}R-squared       ={res}    0.6677
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6450
{txt}       Total {c |} {res} 689.820559        47  14.6770332   {txt}Root MSE        =   {res} 2.2826

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         all{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age {c |}{col 14}{res}{space 2} .8269952{col 26}{space 2} .8189316{col 37}{space 1}    1.01{col 46}{space 3}0.318{col 54}{space 4} -.823453{col 67}{space 3} 2.477443
{txt}{space 6}over21 {c |}{col 14}{res}{space 2} 7.662709{col 26}{space 2} 1.318704{col 37}{space 1}    5.81{col 46}{space 3}0.000{col 54}{space 4} 5.005035{col 67}{space 3} 10.32038
{txt}{space 4}over_age {c |}{col 14}{res}{space 2}-3.603359{col 26}{space 2} 1.158144{col 37}{space 1}   -3.11{col 46}{space 3}0.003{col 54}{space 4}-5.937445{col 67}{space 3}-1.269273
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 93.61837{col 26}{space 2} .9324647{col 37}{space 1}  100.40{col 46}{space 3}0.000{col 54}{space 4} 91.73911{col 67}{space 3} 95.49763
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. predict allfitlini
{txt}(option {bf:xb} assumed; fitted values)

{com}. 
. * Regressions for Figure 4.4.
. * Quadratic, and quadratic on each side
. reg all age age2 over21

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        48
{txt}{hline 13}{c +}{hline 34}   F(3, 44)        = {res}    28.12
{txt}       Model {c |} {res} 453.339903         3  151.113301   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 236.480656        44  5.37456036   {txt}R-squared       ={res}    0.6572
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6338
{txt}       Total {c |} {res} 689.820559        47  14.6770332   {txt}Root MSE        =   {res} 2.3183

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         all{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age {c |}{col 14}{res}{space 2}-.9746843{col 26}{space 2} .5881378{col 37}{space 1}   -1.66{col 46}{space 3}0.105{col 54}{space 4}-2.159998{col 67}{space 3} .2106296
{txt}{space 8}age2 {c |}{col 14}{res}{space 2}-.8186505{col 26}{space 2} .2887482{col 37}{space 1}   -2.84{col 46}{space 3}0.007{col 54}{space 4}-1.400584{col 67}{space 3}-.2367167
{txt}{space 6}over21 {c |}{col 14}{res}{space 2} 7.662709{col 26}{space 2} 1.339349{col 37}{space 1}    5.72{col 46}{space 3}0.000{col 54}{space 4} 4.963428{col 67}{space 3} 10.36199
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 92.90274{col 26}{space 2} .8370061{col 37}{space 1}  110.99{col 46}{space 3}0.000{col 54}{space 4} 91.21587{col 67}{space 3} 94.58962
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. predict allfitq
{txt}(option {bf:xb} assumed; fitted values)

{com}. reg all age age2 over21 over_age over_age2

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        48
{txt}{hline 13}{c +}{hline 34}   F(5, 42)        = {res}    18.02
{txt}       Model {c |} {res} 470.512103         5  94.1024205   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 219.308457        42  5.22162992   {txt}R-squared       ={res}    0.6821
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6442
{txt}       Total {c |} {res} 689.820559        47  14.6770332   {txt}Root MSE        =   {res} 2.2851

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         all{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age {c |}{col 14}{res}{space 2}-.8305827{col 26}{space 2} 3.290064{col 37}{space 1}   -0.25{col 46}{space 3}0.802{col 54}{space 4}-7.470202{col 67}{space 3} 5.809036
{txt}{space 8}age2 {c |}{col 14}{res}{space 2}-.8402999{col 26}{space 2} 1.615268{col 37}{space 1}   -0.52{col 46}{space 3}0.606{col 54}{space 4}-4.100043{col 67}{space 3} 2.419443
{txt}{space 6}over21 {c |}{col 14}{res}{space 2} 9.547789{col 26}{space 2} 1.985277{col 37}{space 1}    4.81{col 46}{space 3}0.000{col 54}{space 4} 5.541337{col 67}{space 3} 13.55424
{txt}{space 4}over_age {c |}{col 14}{res}{space 2}-6.017014{col 26}{space 2} 4.652854{col 37}{space 1}   -1.29{col 46}{space 3}0.203{col 54}{space 4}-15.40685{col 67}{space 3} 3.372825
{txt}{space 3}over_age2 {c |}{col 14}{res}{space 2} 2.904189{col 26}{space 2} 2.284334{col 37}{space 1}    1.27{col 46}{space 3}0.211{col 54}{space 4}-1.705784{col 67}{space 3} 7.514162
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 93.07294{col 26}{space 2} 1.403803{col 37}{space 1}   66.30{col 46}{space 3}0.000{col 54}{space 4} 90.23995{col 67}{space 3} 95.90593
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. predict allfitqi
{txt}(option {bf:xb} assumed; fitted values)

{com}. 
. label variable all       "Mortality rate from all causes (per 100,000)"
{txt}
{com}. label variable allfitlin "Mortality rate from all causes (per 100,000)"
{txt}
{com}. label variable allfitqi  "Mortality rate from all causes (per 100,000)"
{txt}
{com}. 
. * Figure 4.4.            
. twoway (scatter all agecell) (line allfitlin allfitqi agecell if age < 0,  lcolor(red black) lwidth(medthick medthick) lpattern(dash)) ///
>                              (line allfitlin allfitqi agecell if age >= 0, lcolor(red black) lwidth(medthick medthick) lpattern(dash)), ///
>                                                          xline(21, lcolor(cranberry)) legend(off)
{res}{txt}
{com}. 
. graph save Output/fig44, replace
{txt}(note: file Output/fig44.gph not found)
{res}{txt}(file Output/fig44.gph saved)

{com}. graph export Output/fig44.pdf, replace
{txt}(file Output/fig44.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
{txt}end of do-file

{com}. do "C:\Users\lhaase\AppData\Local\Temp\STD6e4_000000.tmp"
{txt}
{com}. *** Metrics
. *** Figures 4.2 4.4 4.5
. *** Tables 4.1
. *** MLDA Regression Discontinuity (based on data from Carpenter and Dobkin 2009)
. 
. clear
{txt}
{com}. 
. // set to directory where data is located
. cd "/Users/lhaase/Documents"
{res}C:\Users\lhaase\Documents
{txt}
{com}. 
. // create a folder called "Output" in that directory
. 
. use AEJfigs.dta
{txt}
{com}. 
. * All = all deaths
. gen age = agecell - 21
{txt}
{com}. gen over21 = agecell >= 21
{txt}
{com}. 
. gen age2 = age^2
{txt}
{com}. gen age3 = age^3
{txt}
{com}. gen over_age = over21*age
{txt}
{com}. gen over_age2 = over21*age2
{txt}
{com}. gen over_age3 = over21*age3
{txt}
{com}. 
. * Regressions for Figure 4.2.
. * linear trend, and linear on each side
. reg all age over21

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        48
{txt}{hline 13}{c +}{hline 34}   F(2, 45)        = {res}    32.99
{txt}       Model {c |} {res} 410.138151         2  205.069075   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 279.682408        45  6.21516463   {txt}R-squared       ={res}    0.5946
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.5765
{txt}       Total {c |} {res} 689.820559        47  14.6770332   {txt}Root MSE        =   {res}  2.493

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         all{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age {c |}{col 14}{res}{space 2}-.9746843{col 26}{space 2} .6324613{col 37}{space 1}   -1.54{col 46}{space 3}0.130{col 54}{space 4}-2.248527{col 67}{space 3} .2991581
{txt}{space 6}over21 {c |}{col 14}{res}{space 2} 7.662709{col 26}{space 2} 1.440286{col 37}{space 1}    5.32{col 46}{space 3}0.000{col 54}{space 4} 4.761824{col 67}{space 3} 10.56359
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 91.84137{col 26}{space 2} .8050394{col 37}{space 1}  114.08{col 46}{space 3}0.000{col 54}{space 4} 90.21994{col 67}{space 3}  93.4628
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. predict allfitlin
{txt}(option {bf:xb} assumed; fitted values)

{com}. reg all age over21 over_age

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        48
{txt}{hline 13}{c +}{hline 34}   F(3, 44)        = {res}    29.47
{txt}       Model {c |} {res} 460.574058         3  153.524686   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 229.246501        44  5.21014775   {txt}R-squared       ={res}    0.6677
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6450
{txt}       Total {c |} {res} 689.820559        47  14.6770332   {txt}Root MSE        =   {res} 2.2826

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         all{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age {c |}{col 14}{res}{space 2} .8269952{col 26}{space 2} .8189316{col 37}{space 1}    1.01{col 46}{space 3}0.318{col 54}{space 4} -.823453{col 67}{space 3} 2.477443
{txt}{space 6}over21 {c |}{col 14}{res}{space 2} 7.662709{col 26}{space 2} 1.318704{col 37}{space 1}    5.81{col 46}{space 3}0.000{col 54}{space 4} 5.005035{col 67}{space 3} 10.32038
{txt}{space 4}over_age {c |}{col 14}{res}{space 2}-3.603359{col 26}{space 2} 1.158144{col 37}{space 1}   -3.11{col 46}{space 3}0.003{col 54}{space 4}-5.937445{col 67}{space 3}-1.269273
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 93.61837{col 26}{space 2} .9324647{col 37}{space 1}  100.40{col 46}{space 3}0.000{col 54}{space 4} 91.73911{col 67}{space 3} 95.49763
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. predict allfitlini
{txt}(option {bf:xb} assumed; fitted values)

{com}. 
. * Regressions for Figure 4.4.
. * Quadratic, and quadratic on each side
. reg all age age2 age3 over21

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        48
{txt}{hline 13}{c +}{hline 34}   F(4, 43)        = {res}    21.46
{txt}       Model {c |} {res} 459.592233         4  114.898058   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 230.228327        43  5.35414713   {txt}R-squared       ={res}    0.6662
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6352
{txt}       Total {c |} {res} 689.820559        47  14.6770332   {txt}Root MSE        =   {res} 2.3139

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         all{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age {c |}{col 14}{res}{space 2}-2.432566{col 26}{space 2} 1.471286{col 37}{space 1}   -1.65{col 46}{space 3}0.106{col 54}{space 4}-5.399696{col 67}{space 3} .5345651
{txt}{space 8}age2 {c |}{col 14}{res}{space 2}-.8186505{col 26}{space 2} .2881994{col 37}{space 1}   -2.84{col 46}{space 3}0.007{col 54}{space 4} -1.39986{col 67}{space 3}-.2374411
{txt}{space 8}age3 {c |}{col 14}{res}{space 2} .4165754{col 26}{space 2} .3854942{col 37}{space 1}    1.08{col 46}{space 3}0.286{col 54}{space 4}-.3608478{col 67}{space 3} 1.193999
{txt}{space 6}over21 {c |}{col 14}{res}{space 2}  8.94116{col 26}{space 2} 1.785129{col 37}{space 1}    5.01{col 46}{space 3}0.000{col 54}{space 4} 5.341105{col 67}{space 3} 12.54121
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 92.26352{col 26}{space 2} 1.023635{col 37}{space 1}   90.13{col 46}{space 3}0.000{col 54}{space 4} 90.19916{col 67}{space 3} 94.32787
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. predict allfitq
{txt}(option {bf:xb} assumed; fitted values)

{com}. reg all age age2 age3 over21 over_age over_age2 over_age3

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        48
{txt}{hline 13}{c +}{hline 34}   F(7, 40)        = {res}    12.67
{txt}       Model {c |} {res} 475.400405         7  67.9143435   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 214.420154        40  5.36050386   {txt}R-squared       ={res}    0.6892
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6348
{txt}       Total {c |} {res} 689.820559        47  14.6770332   {txt}Root MSE        =   {res} 2.3153

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         all{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age {c |}{col 14}{res}{space 2}-5.634231{col 26}{space 2} 8.397881{col 37}{space 1}   -0.67{col 46}{space 3}0.506{col 54}{space 4}-22.60698{col 67}{space 3} 11.33852
{txt}{space 8}age2 {c |}{col 14}{res}{space 2}-6.922098{col 26}{space 2} 9.895115{col 37}{space 1}   -0.70{col 46}{space 3}0.488{col 54}{space 4}-26.92087{col 67}{space 3} 13.07667
{txt}{space 8}age3 {c |}{col 14}{res}{space 2}-2.055422{col 26}{space 2} 3.298124{col 37}{space 1}   -0.62{col 46}{space 3}0.537{col 54}{space 4}-8.721179{col 67}{space 3} 4.610334
{txt}{space 6}over21 {c |}{col 14}{res}{space 2} 11.26283{col 26}{space 2}  2.69992{col 37}{space 1}    4.17{col 46}{space 3}0.000{col 54}{space 4} 5.806093{col 67}{space 3} 16.71958
{txt}{space 4}over_age {c |}{col 14}{res}{space 2}-6.790409{col 26}{space 2}  11.8764{col 37}{space 1}   -0.57{col 46}{space 3}0.571{col 54}{space 4} -30.7935{col 67}{space 3} 17.21268
{txt}{space 3}over_age2 {c |}{col 14}{res}{space 2} 16.04696{col 26}{space 2} 13.99381{col 37}{space 1}    1.15{col 46}{space 3}0.258{col 54}{space 4}-12.23557{col 67}{space 3}  44.3295
{txt}{space 3}over_age3 {c |}{col 14}{res}{space 2}-.3309261{col 26}{space 2} 4.664251{col 37}{space 1}   -0.07{col 46}{space 3}0.944{col 54}{space 4} -9.75773{col 67}{space 3} 9.095878
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  92.2793{col 26}{space 2} 1.909132{col 37}{space 1}   48.34{col 46}{space 3}0.000{col 54}{space 4}  88.4208{col 67}{space 3}  96.1378
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. predict allfitqi
{txt}(option {bf:xb} assumed; fitted values)

{com}. 
. label variable all       "Mortality rate from all causes (per 100,000)"
{txt}
{com}. label variable allfitlin "Mortality rate from all causes (per 100,000)"
{txt}
{com}. label variable allfitqi  "Mortality rate from all causes (per 100,000)"
{txt}
{com}. 
. * Figure 4.4.            
. twoway (scatter all agecell) (line allfitlin allfitqi agecell if age < 0,  lcolor(red black) lwidth(medthick medthick) lpattern(dash)) ///
>                              (line allfitlin allfitqi agecell if age >= 0, lcolor(red black) lwidth(medthick medthick) lpattern(dash)), ///
>                                                          xline(21, lcolor(cranberry)) legend(off)
{res}{txt}
{com}. 
. graph save Output/fig44_3, replace
{txt}(note: file Output/fig44_3.gph not found)
{res}{txt}(file Output/fig44_3.gph saved)

{com}. graph export Output/fig44_3.pdf, replace
{txt}(file Output/fig44_3.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
{txt}end of do-file

{com}. do "C:\Users\lhaase\AppData\Local\Temp\STD6e4_000000.tmp"
{txt}
{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\lhaase\Documents\hw1_log.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}27 Mar 2020, 23:19:13
{txt}{.-}
{smcl}
{txt}{sf}{ul off}